#+TITLE: Uri's SM in Lisp
#+DATE: <2015-11-23 Mon>
#+AUTHOR: Brian Beckman, Uri Ran
#+EMAIL: bbeckman@amazon.com
#+OPTIONS: ':t *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t c:nil creator:comment d:(not LOGBOOK) date:t e:t
#+OPTIONS: email:nil f:t inline:t num:t p:nil pri:nil stat:t tags:t
#+OPTIONS: tasks:t tex:t timestamp:t toc:t todo:t |:t
#+CREATOR: Emacs 24.3.1 (Org mode 8.0.7)
#+DESCRIPTION:
#+EXCLUDE_TAGS: noexport
#+KEYWORDS:
#+LANGUAGE: en
#+SELECT_TAGS: export
#+LaTeX_CLASS_OPTIONS: [10pt,oneside,x11names]
#+LaTeX_HEADER: \usepackage{geometry}
#+LaTeX_HEADER: \usepackage{palatino}
#+LaTeX_HEADER: \usepackage{siunitx}
#+LaTeX_HEADER: \usepackage{braket}
#+LaTeX_HEADER: \usepackage[euler-digits,euler-hat-accent]{eulervm}
#+OPTIONS: toc:2

* Version information
  #+BEGIN_SRC emacs-lisp :results output :exports results :tangle no
    (princ (concat (format "Emacs version: %s\n" (emacs-version))
                   (format "org version: %s\n" (org-version))))
    (setq org-confirm-babel-evaluate nil)
    (org-babel-map-src-blocks nil (org-babel-remove-result))
  #+END_SRC

  #+RESULTS:
  : Emacs version: GNU Emacs 24.5.1 (x86_64-apple-darwin13.4.0, NS apple-appkit-1265.21)
  :  of 2015-04-10 on builder10-9.porkrind.org
  : org version: 8.3.1

  This is version 0.3 of Uri Ran's State-Machine demo.

** Unit Tests, Exhaustive Tests

   Because the current guards are random, exhaustively testing them isn't as
   trivial as enumeration.

   Run the following unit test repeatedly; it can be a little different each
   time, but the machine should always end up in vertex 3.

#+BEGIN_SRC lisp :results output :exports both :tangle yes
(print (equal *current-vertex* *vertex-1*))
(print (eq *current-vertex* *vertex-1*))
(print (eq (sm-engine 'ev-1) *vertex-1*))
(print (eq (sm-engine 'ev-4) *vertex-1*))
(print (eq (sm-engine 'bogus) *vertex-1*))
(print (eq (sm-engine 'ev-3) *vertex-1*))
(print (eq (sm-engine 'ev-2) *vertex-3*))
#+END_SRC

#+RESULTS:
#+begin_example

T
T
vertex-1: event EV-1 not found; doing nothing
T
vertex-1: event EV-4 not found; doing nothing
T
vertex-1: event BOGUS not found; doing nothing
T
"vertex 1 exit"
"action na"
"vertex 1 entry"
T
"vertex 1 exit"
"action c"
"vertex 3 entry"
T
#+end_example
